<template>
  <div class="post">
    <h4>1.javascript基础</h4>javascript组成
    . ecmascript:解释器，翻译
    <p>. dom : document object model</p>
    <p>. bom : browser object model</p>
    <p>- 各组成部分的前容性，前容性问题的由来</p>

    <h4>2.变量类型(1)</h4>.类型：typeof运算符
    <p>. 用法： 返回值</p>. 常见的类型：- number, string,undefined,object,function
    <p>. 一个变量应该只存放一种类型的数据</p>

    <h4>3.变量类型（2）</h4>.数据类型转换
    <p>.计算两个文本框的和</p>
    <p>. 显示类型转换（强制类型转换）</p>- pars elnt(),parsefloat()
    <p>-nan的意义和检测</p>
    <p>. 隐式类型的转换</p>
    <p>- = = , = = =</p>
    <p>- 减法</p>

    <h4>4.变量作用域和闭包</h4>
    <p>. 变量和作用域（作用范围）</p>
    <p>.局部的变量和全局的变量</p>
    <p>. 什么是闭包？</p>.子函数可以使用父函数中的局部变量
    <p>.之前一直在使用闭包</p>
    <p>. 网上对于闭包的定义</p>

    <h4>5.命名规范(1)</h4>

    <p>.命名规范及必要性</p>
    <p>. 可读性——————能看懂</p>
    <p>.规范性——————符合规则</p>
    <p>牙利命明法</p>
    <p>.类型前缀</p>
    <p>.首字母大写</p>

    <h4>6.运算符</h4>
    <p>. 算术 ： + 加， - 减， * 乘， / 除， % 取模</p>
    <p>. 实例 ： 隔行变色 ，秒转时间</p>
    <p>. 赋值：= ，+=， -= ，*= ， /= ，%=</p>
    <p>. 关系：</p>
    <p>. 逻辑： 与，｜｜或、！否</p>
    <p>. 实例：全选与反选</p>
    <p>. 运算符优先级：括号</p>
    <div class></div>
    <h4>7.程序流程控制</h4>
    <p>判断：if、switch、？：</p>
    <p>循环：while、for</p>
    <p>跳出：break、continue</p>
    <p>什么是真、什么是假：</p>
    <p>. 真：true 、非零数字、非空字符串、非空对象</p>
    <p>假：false、数字零、空字符串、空对象、undefined</p>
    <h4>8.json</h4>
    <p>.什么是json</p>
    <p>.json和数组</p>
    <p>.json和for in</p>
    <h4>9.命名规范（2）</h4>

    <p>类型：--------------前缀----------类型----------------实例</p>
    <p>数组：----------------a------------array--------------altems</p>
    <p>布尔值：--------------b------------boolean--------blscomplete</p>
    <p>浮点数：--------------f------------float--------------fprice</p>
    <p>函数：--------------fn-----------function-----------fnhandler</p>
    <p>整数：---------------i------------lnteger------------iltemcount</p>
    <p>对象：----------------o----------object------------odivl</p>
    <p>正则表达式：----re-----------regexp-------------eenailcheck</p>
    <p>字符串：--------s--------------string--------------susername</p>
    <p>变体变量：------v--------------variant--------------vanything</p>
    <h4>10.数组基础</h4>
    <h5>.数组的使用</h5>
    <p>.定义</p>-var arr=[12,5,8,9];
    <p>-var arr=new array（12，5，8，9）</p>
    <p>-没有任何差别，[]的性能略高，因为代码短</p>
    <h5>数组的属性</h5>
    <p>length</p>
    <p>-既可以获取，又可以设置</p>
    <p>-例子：快速清空数组</p>
    <h5>数组使用的原则：数组中应该只有一种类型的变量</h5>
    <h4>11 .函数返回值</h4>
    <h5>.函数返回值</h5>
    <p>.什么是函数返回值</p>
    <p>-函数执行的结果</p>
    <p>可以没有return</p>
    <p>. 一个函数应该只返回一个类型的值</p>
    <h4>12 . 函数传值</h4>
    <p>.可变参数（不定参）：arguments</p>
    <p>.参数的个数可变，参数数组</p>
    <p>.例子1: 求职</p>
    <p>. 求所有参数的和</p>
    <p>.例子2；css函数</p>
    <p>.判断arguments.length</p>
    <p>.给参数取名，增强可读性</p>
    <p>.取非行间样式（不能用来设置）</p>
    <p>- obj.currentstyle[attr]</p>
    <p>- getcomputedstyle(obj false)[attr]</p>
    <h4>13 . 数组基础</h4>
    <h5>.增加，删除元素</h5>
    <p>. 数组的方法</p>
    <p>-push(元素)，从尾部增加</p>
    <p>- unshift(元素)从头部增加</p>
    <p>. 删除</p>
    <p>- pop(),从尾部弹出</p>
    <p>- shift()从头部弹出</p>
    <h4>14排序、转换</h4>
    <h5>.排序</h5>
    <p>. sort([比较函数]),排序一个数组</p>
    <p>- 一个字符串数组</p>
    <p>- 排序一个数字数组</p>
    <h5>. 转换类</h5>
    <p>.concat(数组2)</p>
    <p>- 链接两个数组</p>
    <p>. jojn(分隔符)</p>
    <p>- 用分隔符，组合数组元素，生成字符串</p>
    <p>- 字符串splid</p>
    <h4>15 .插入、删除</h4>
    <p>. splice</p>
    <p>.splice(开始，长度，元素...)</p>
    <p> . 先删除，后插入</p>
    <h5>.删除</h5>
    <p>. splice（开始，长度）</p>
    <h5>. 插入</h5>
    <p> . splice(开始，0，元素...)</p>
    <h5>. 替换</h5>
    <p></p>
    <p></p>
    <p></p>

  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
</style>